{
  "_name_or_path": "vimassaru/segformer-b0-finetuned-teeth-segmentation",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "downsampling_rates": [
    1,
    4,
    8,
    16
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "background",
    "1": "11",
    "2": "12",
    "3": "13",
    "4": "14",
    "5": "15",
    "6": "16",
    "7": "17",
    "8": "18",
    "9": "21",
    "10": "22",
    "11": "23",
    "12": "24",
    "13": "25",
    "14": "26",
    "15": "27",
    "16": "28",
    "17": "31",
    "18": "32",
    "19": "33",
    "20": "34",
    "21": "35",
    "22": "36",
    "23": "37",
    "24": "38",
    "25": "41",
    "26": "42",
    "27": "43",
    "28": "44",
    "29": "45",
    "30": "46",
    "31": "47",
    "32": "48"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "11": 1,
    "12": 2,
    "13": 3,
    "14": 4,
    "15": 5,
    "16": 6,
    "17": 7,
    "18": 8,
    "21": 9,
    "22": 10,
    "23": 11,
    "24": 12,
    "25": 13,
    "26": 14,
    "27": 15,
    "28": 16,
    "31": 17,
    "32": 18,
    "33": 19,
    "34": 20,
    "35": 21,
    "36": 22,
    "37": 23,
    "38": 24,
    "41": 25,
    "42": 26,
    "43": 27,
    "44": 28,
    "45": 29,
    "46": 30,
    "47": 31,
    "48": 32,
    "background": 0
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.48.2"
}
